package betterstatusbar.status.enums;

public enum Events {
    安葬, 祭祀, 嫁娶, 领证, 结婚, 入宅, 动土, 出行, 旅游, 安床, 搬家, 祈福, 移徙, 开市, 开业, 开张, 开工, 破土, 开光, 作灶, 入殓, 栽种, 订婚, 纳采, 解除, 装修, 修造, 上梁, 纳畜, 立券, 启钻, 求嗣, 拆卸, 馀事勿取, 移柩, 交易, 伐木, 出火, 纳财, 除服, 成服, 认养, 进人口, 订盟, 斋醮, 安门, 冠笄, 裁衣, 沐浴, 竖柱, 赴任, 盖屋, 会亲友, 掘井, 修坟, 理发, 置产, 挂匾, 谢土, 求医, 作梁, 行丧, 起基, 牧养, 安香, 放水, 塑绘, 坏垣, 扫舍, 立碑, 破屋, 经络, 合帐, 开仓, 治病, 造畜稠, 入学, 塞穴, 平治道涂, 求财, 结网, 捕捉, 打官司, 词讼, 筑堤, 开池, 安机械, 分居, 纳婿, 修饰垣墙, 补垣, 针灸, 乘船, 招赘, 探病, 造仓, 造桥, 取渔, 架马, 开渠, 畋猎, 造庙, 造船, 整手足甲, 定磉, 出货, 开生坟, 诸事不宜, 教牛马, 和讼, 酬神, 出货财, 开厕, 开柱眼, 造车器, 合寿木, 出师, 归宁, 造床, 求人, 服药, 恩赦, 藏宝, 安碓硙, 习艺, 合脊, 断蚁, 问名, 送礼, 雇佣, 割蜜, 鸣鼓, 设醮;
}
