package betterstatusbar.status.enums;

public enum Events {
    安葬, 结婚, 祭祀, 搬新房, 动土, 开业, 出行, 破土, 搬家, 祈福, 安床, 开光, 作灶, 入殓, 合婚订婚, 修造, 打扫, 栽种, 上梁, 交易, 馀事勿取, 出火, 订盟, 签订合同, 移柩, 拆卸, 纳畜, 求子, 迁坟, 会亲友, 安门, 除服, 伐木, 成服, 沐浴, 斋醮, 掘井, 成人礼, 收养子女, 纳财, 起基, 盖屋, 买衣服, 牧养, 治病, 理发, 谢土, 诸事不宜, 行丧, 竖柱, 房屋清洁, 修坟, 结网, 立碑, 作梁, 挂匾, 塑绘, 安香, 坏垣, 造畜稠, 破屋, 安机械, 除虫, 塞穴, 开池, 买房, 打猎, 无, 求医, 铺路, 买车, 开仓, 造庙, 合帐, 放水, 装修, 探病, 造船, 造桥, 补垣, 赴任, 定磉, 求职入学, 诉讼, 合寿木, 出货财, 开生坟, 教牛马, 架马, 造车器, 造仓, 打鱼, 开厕, 开渠, 美甲浴足, 针灸, 出行上任, 开工开业, 建房, 动手术, 大事勿用, 开柱眼, 安装器具, 合嵴, 筑堤, 雕刻, 普渡, 断蚁, 习艺, 纳婿, 问名, 酬神, 分居, 割蜜, 归岫, 嫁娶, 领证, 入宅, 旅游, 移徙, 开市, 开张, 开工, 解除, 订婚, 纳采, 立券, 启钻, 乘船, 求嗣, 归宁, 雇庸, 认养, 进人口, 裁衣, 冠笄, 扫舍, 平治道涂, 置产, 修饰垣墙, 捕捉, 经络, 打官司, 词讼, 入学, 整手足甲, 畋猎, 取渔, 安碓硙, 合脊, 雇佣;
}
